backend/app/controllers/beans_controller.rb

  def index
    beans = Bean.all
---
SELECT `beans`.* FROM `beans`

  def create
    bean = Bean.new(beans_param)

    if bean.save
---
INSERT INTO `beans` (`name`, `producingArea`, `kind`, `degreeOfRoasting`, `price`, `acidity`, `bitter`, `sweety`, `fullBody`, `aroma`, `comments`, `created_at`, `updated_at`, `shop_id`) VALUES ('aaa', 'sss', 'dd', 0, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2023-09-25 12:49:20.475767', '2023-09-25 12:49:20.475767', NULL)

  def show
    bean = Bean.find(params[:id])
---
SELECT `beans`.* FROM `beans` WHERE `beans`.`id` = 1 LIMIT 1

  def update
    bean = Bean.find(params[:id])
    if bean.update(beans_param)
---
SELECT `beans`.* FROM `beans` WHERE `beans`.`id` = 5 LIMIT 1
UPDATE `beans` SET `beans`.`name` = 'ケニアケニア', `beans`.`producingArea` = 'ケニア', `beans`.`kind` = 'ケニア', `beans`.`updated_at` = '2023-10-01 03:57:41.278978' WHERE `beans`.`id` = 12

  def destroy
    bean = Bean.find(params[:id])
    bean.destroy!
---
SELECT `beans`.* FROM `beans` WHERE `beans`.`id` = 9 LIMIT 1
DELETE FROM `beans` WHERE `beans`.`id` = 9